data/Parm_PH_29/alpha_15/alpha_15_13929_3036/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0598279108762468 1.00195552661621 0)
(0.179487735227664 1.00098982732375 -1.60361986554574e-18)
(0.298980181048245 0.995041871687548 -9.31596899814997e-18)
(0.417446930650885 0.978946172537143 -1.53309095328162e-17)
(0.533245920912999 0.949496200491004 9.48441345782699e-20)
(0.645178483362424 0.907480352769988 -1.59915568093045e-18)
(0.753532035919987 0.85681294031917 0)
(0.859331591607705 0.800988441632287 2.75785242627565e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0598314189324665 1 0)
(0.179479534051771 0.999032710501484 0)
(0.298901383254898 0.99308080818452 0)
(0.417257892774664 0.97698535390977 0)
(0.532928643326787 0.947546643507698 0)
(0.644770985661909 0.905520761903866 0)
(0.753073120968577 0.854803707218437 0)
(0.85884583063665 0.798894113055979 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0580375 3.036 0)
(0.1741125 3.036 0)
(0.2901875 3.036 0)
(0.4062625 3.036 0)
(0.5223375 3.036 0)
(0.6384125 3.036 0)
(0.7544875 3.036 0)
(0.8705625 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
