data/Parm_PH_29/alpha_15/alpha_15_13929_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00187378 -0.00000857 0.00000000 0.00000037 0.00000000 0.00087306)
(0.00211733 -0.00000398 0.00000000 -0.00000212 0.00000000 0.00088662)
(0.00021343 -0.00016179 0.00000000 0.00011280 0.00000000 0.00093852)
(0.00030614 0.00004965 0.00000000 -0.00003019 0.00000000 0.00015294)
(0.00003363 -0.00018225 0.00000000 0.00014535 0.00000000 0.00069019)
(0.00080949 -0.00046269 0.00000000 0.00023694 0.00000000 0.00120197)
(0.00105868 -0.00069030 0.00000000 0.00043704 0.00000000 0.00286239)
(0.00065228 -0.00053631 0.00000000 0.00040194 0.00000000 0.00122121)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
